//////////////////////////////////////////////////////////////////
//Задача 1: Отфильтровать чётные числа
//Дан массив чисел. Оставь только чётные числа.
const numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9];
const numbersEven = numbers.filter(el => (el % 2) === 0);
console.log(numbersEven);

//////////////////////////////////////////////////////////////////
//Задача 2: Удалить пустые строки
//Дан массив строк. Удали все пустые строки.
const words = ['hello', 'JS', '', 'KZ', '', ''];
const wordsNoEmpty = words.filter(el => el !== '');
console.log(wordsNoEmpty);

//////////////////////////////////////////////////////////////////
//Задача 3: Оставить положительные числа
//Дан массив чисел. Оставь только положительные значения.
const values = [-5, 10, 0, -3, 8, 36, 1, -15];
const valuesPos = values.filter(el => el > 0);
console.log(valuesPos);

//////////////////////////////////////////////////////////////////
//Задача 4: Отобрать совершеннолетних пользователей
//Дан массив объектов пользователей. Оставь только тех, кому 18 и более лет.
const users = [
    { name: "Alice", age: 17 },
    { name: "Bob", age: 22 },
    { name: "Charlie", age: 16 },
    { name: "David", age: 18 },
];
const usersAd = users.filter(el => el.age >= 18);
console.log(usersAd);

//////////////////////////////////////////////////////////////////
//Задача 5: Убрать недопустимые email'ы
//Дан массив строк с email-адресами. Оставь только те, которые содержат символ @.
const emails = ["test@mail.com", "invalid.email", "hello@site.org", "no_at_symbol"];
const correctEmails = emails.filter(el => el.includes('@'));
console.log(correctEmails);

//////////////////////////////////////////////////////////////////
//Задача 6: Оставить только уникальные элементы
//Дан массив с повторяющимися значениями. Оставь только те, которые встречаются один раз.
const items = [1, 2, 2, 3, 4, 4, 5];
const uniqueItems = items.filter(el => items.indexOf(el) === items.lastIndexOf(el));
console.log(uniqueItems);

//////////////////////////////////////////////////////////////////