//////////////////////////////////////////////////////////////////
// Задача 1: Приведи вложенный массив к одному уровню 
const nested = [1, [2, 3], [4, [5, 6]]];
const newNested = nested.flat(1);
console.log(newNested);

//////////////////////////////////////////////////////////////////
// Задача 2: Расплющи массив на 2 уровня вложенности
const deepNested = [1, [2, [3, [4]]]];
const newDeepNested = deepNested.flat(2);
console.log(newDeepNested);

//////////////////////////////////////////////////////////////////
// Задача 3: Получить массив длин всех строк и сделать его плоским
const words = ['hello', 'world'];
const newWords = words.flatMap(el => [el.length]);
console.log(newWords);

//////////////////////////////////////////////////////////////////
// Задача 4: У каждого пользователя есть список телефонов. Получи единый список всех телефонов
const users = [
    { name: 'Tom', phones: ['123', '456'] },
    { name: 'Anna', phones: ['789'] }
];
const newUsers = users.flatMap(el => el.phones);
console.log(newUsers);

//////////////////////////////////////////////////////////////////
// Задача 5: Из массива предложений получить массив всех слов
const sentences = ['hello world', 'flat map is cool'];
const newSentences = sentences.flatMap(el => el.split(' '));
console.log(newSentences);

//////////////////////////////////////////////////////////////////
// Задача 6: Из массива с пропущенными значениями [1, 2, [3, [4]], , 5] убрать все пустоты и вложенность
const arr = [1, 2, [3, [4]], , 5];
const newArr = arr.flat(2);
console.log(newArr);

//////////////////////////////////////////////////////////////////

