//////////////////////////////////////////////////////////////////
//Задача 1: Увеличить каждый элемент массива на 2.
//Дан массив чисел.Верни новый массив, где каждое число увеличено на 2
const numbers = [1, 2, 3, 4];
const newArray = numbers.map(el => el + 2);
console.log(newArray);

//////////////////////////////////////////////////////////////////
//Задача 2: Преобразовать строки в верхний регистр.
//Дан массив строк. Верни новый массив, где все строки в верхнем регистре.
const fruits = ['apple', 'banana', 'pineapple'];
const fruitsUpperCase = fruits.map(el => el.toUpperCase());
console.log(fruitsUpperCase);

//////////////////////////////////////////////////////////////////
//Задача 3: Получить длину каждой строки.
//Дан массив строк. Верни новый массив, содержащий длину каждой строки.
const word = ['Hello', 'Privet', 'Kazakhstan', 'Mangystau'];
const wordLength = word.map(el => el.length);
console.log(wordLength);

//////////////////////////////////////////////////////////////////
//Задача 4: Добавить индекс к каждому элементу
//Дан массив чисел. Верни новый массив, где к каждому числу прибавляется его индекс.
const numers = [10, 20, 30];
const numbersPlusIndex = numers.map((el, idx) => el + idx);
console.log(numbersPlusIndex);

//////////////////////////////////////////////////////////////////
//Задача 5: Объекты: Извлечь имена
//Дан массив объектов с полями name и age. Верни массив только из имён.
const users = [
    { name: 'Alex', age: 18 },
    { name: 'Petr', age: 32 },
    { name: 'Gustavo', age: 46 },
]
const userNames = users.map(el => el.name);
console.log(userNames);

//////////////////////////////////////////////////////////////////
//Задача 6: Преобразовать числа в строки с символом $
//Дан массив чисел. Верни массив строк, представляющих эти числа как суммы в долларах.
const prices = [13, 37, 91];
const newPrices = prices.map(el => '$' + el);
console.log(newPrices);

//////////////////////////////////////////////////////////////////
//Задача 7: Возвести в квадрат
//Дан массив чисел. Верни массив, где каждое число возведено в квадрат.
const nums = [3, 4, 5, 6, 7];
const doubleNums = nums.map(el => el ** 2);
console.log(doubleNums);

//////////////////////////////////////////////////////////////////
