//////////////////////////////////////////////////////////////////
// Задача 1: Получить подмассив [2, 3] из массива [1, 2, 3, 4, 5]
const arr = [1, 2, 3, 4, 5];
console.log(arr.slice(1, -2));

//////////////////////////////////////////////////////////////////
// Задача 2: Скопировать массив ['x', 'y', 'z'] полностью
const arr2 = ['x', 'y', 'z'];
console.log(arr2.slice());

//////////////////////////////////////////////////////////////////
// Задача 3: Получить последние 2 элемента массива ['a', 'b', 'c', 'd']
const arr3 = ['a', 'b', 'c', 'd'];
console.log(arr3.slice(-2));

//////////////////////////////////////////////////////////////////
// Задача 4: Получить подмассив со второго по предпоследний элемент массива [10, 20, 30, 40, 50]
const arr4 = [10, 20, 30, 40, 50];
console.log(arr4.slice(1, -1));

//////////////////////////////////////////////////////////////////
// Задача 5: Получить пустой массив, используя slice() на массиве [1, 2, 3]
const arr5 = [1, 2, 3];
console.log(arr5.slice(0, 0));

//////////////////////////////////////////////////////////////////

