//////////////////////////////////////////////////////////////////
// Задача 1: Удалить 2 элемента, начиная с индекса 1, из массива ['a', 'b', 'c', 'd']
const arr = ['a', 'b', 'c', 'd'];
const delArr = arr.splice(1, 2);
console.log(arr);
console.log(delArr);

//////////////////////////////////////////////////////////////////
// Задача 2: Вставить 'x' и 'y' на индекс 2 в массив [1, 2, 3, 4]
const arr2 = [1, 2, 3, 4];
const delArr2 = arr2.splice(2, 0, 'x', 'y');
console.log(arr2);
console.log(delArr2);

//////////////////////////////////////////////////////////////////
// Задача 3: Заменить 2 элемента с индекса 0 на 'cat' и 'dog' в массиве ['a', 'b', 'c']
const arr3 = ['a', 'b', 'c'];
const delArr3 = arr3.splice(0, 2, 'cat', 'dog');
console.log(arr3);
console.log(delArr3);

//////////////////////////////////////////////////////////////////
// Задача 4: Удалить последний элемент массива, используя splice()
const arr4 = ['a', 'b', 'c', 'd'];
const delArr4 = arr4.splice(-1);
console.log(arr4);
console.log(delArr4);

//////////////////////////////////////////////////////////////////
// Задача 5: Вставить 'start' в начало массива ['middle', 'end'] без удаления элементов
const arr5 = ['middle', 'end'];
const delArr5 = arr5.splice(0, 0, 'start');
console.log(arr5);
console.log(delArr5);

//////////////////////////////////////////////////////////////////

